In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('data.csv')

In [3]:
df.head()

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [4]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [5]:
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [6]:
## Handling missing val
df.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [7]:
#filling missing values with mean of the column
df['Sales_fillna'] = df['Sales'].fillna(df['Sales'].mean())

In [8]:
df.head()

         Date Category  Value   Product  Sales Region  Sales_fillna
0  2023-01-01        A   28.0  Product1  754.0   East         754.0
1  2023-01-02        B   39.0  Product3  110.0  North         110.0
2  2023-01-03        C   32.0  Product2  398.0   East         398.0
3  2023-01-04        B    8.0  Product1  522.0   East         522.0
4  2023-01-05        B   26.0  Product3  869.0  North         869.0

In [9]:
## Renaming the columns
df = df.rename(columns={'Date': 'Sales Date'})
df.head()

   Sales Date Category  Value   Product  Sales Region  Sales_fillna
0  2023-01-01        A   28.0  Product1  754.0   East         754.0
1  2023-01-02        B   39.0  Product3  110.0  North         110.0
2  2023-01-03        C   32.0  Product2  398.0   East         398.0
3  2023-01-04        B    8.0  Product1  522.0   East         522.0
4  2023-01-05        B   26.0  Product3  869.0  North         869.0

In [10]:
# change data type 
df['Value_new'] = df['Value'].fillna(df['Value'].mean()).astype(float)  #creating new Value col which have datatype float
df.head()

   Sales Date Category  Value   Product  Sales Region  Sales_fillna  Value_new
0  2023-01-01        A   28.0  Product1  754.0   East         754.0       28.0
1  2023-01-02        B   39.0  Product3  110.0  North         110.0       39.0
2  2023-01-03        C   32.0  Product2  398.0   East         398.0       32.0
3  2023-01-04        B    8.0  Product1  522.0   East         522.0        8.0
4  2023-01-05        B   26.0  Product3  869.0  North         869.0       26.0

#### Applying Function to table values

In [12]:
def percent_val(x):
    return (20/100)*x

df['20% of value'] = df['Value'].apply(percent_val)

In [13]:
df.head()

,Sales Date,Category,Value,Product,Sales,Region,Sales_fillna,Value_new,20% of value
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28.0,5.6
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39.0,7.8
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32.0,6.4
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,8.0,1.6
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,26.0,5.2

In [17]:
#grouped mean 
grouped_mean = df.groupby('Product')['Value'].mean()
print(grouped_mean)

Product
Product1    46.214286
Product2    52.800000
Product3    55.166667
Name: Value, dtype: float64

In [21]:
#grouped sum according to region - data operation
grouped_sum = df.groupby(['Product','Region'])['Value'].sum()
print(grouped_sum)

Product   Region
Product1  East      292.0
          North       9.0
          South     100.0
          West      246.0
Product2  East       56.0
          North     127.0
          South     181.0
          West      428.0
Product3  East      202.0
          North     203.0
          South     215.0
          West      373.0
Name: Value, dtype: float64

In [25]:
#Aggrigating multiple function
grouped_agg = df.groupby(['Product','Region'])['Value'].agg(['mean','sum','count'])
grouped_agg

                      mean    sum  count
Product  Region
Product1 East    41.714286  292.0      7
         North    4.500000    9.0      2
         South   50.000000  100.0      2
         West    82.000000  246.0      3
Product2 East    28.000000   56.0      2
         North   63.500000  127.0      2
         South   60.333333  181.0      3
         West    53.500000  428.0      8
Product3 East    50.500000  202.0      4
         North   40.600000  203.0      5
         South   71.666667  215.0      3
         West    62.166667  373.0      6

#### Merging and Joining dataframes

In [34]:
df1 = pd.DataFrame({'Key':['A','B','C'],'Value':[1,2,3]})
df2 = pd.DataFrame({'Key':['A','B','D'],'Value':[4,5,6]})

In [36]:
df1

  Key  Value
0   A      1
1   B      2
2   C      3

In [38]:
df2

  Key  Value
0   A      4
1   B      5
2   D      6

In [44]:
#merging dataframes
pd.merge(df1,df2,on='Key',how='inner')  #inner -common attributes

  Key  Value_x  Value_y
0   A        1        4
1   B        2        5

In [48]:
pd.merge(df1,df2,on='Key',how='outer')  #outer - considering everything

  Key  Value_x  Value_y
0   A      1.0      4.0
1   B      2.0      5.0
2   C      3.0      NaN
3   D      NaN      6.0

In [56]:
pd.merge(df1,df2,on='Key',how='left')  #left = df1 will get more priority

  Key  Value_x  Value_y
0   A        1      4.0
1   B        2      5.0
2   C        3      NaN

In [60]:
pd.merge(df1,df2,on='Key',how='right')  #Right = df2 will get more priority

  Key  Value_x  Value_y
0   A      1.0        4
1   B      2.0        5
2   D      NaN        6